sterentev/atdf-device-asm-include/inc/ATmega329P.inc
; ----------	Register LCDDR2 bits		------------------------
.equ	SEG016		= 0		; 0x01 - LCD memory bit segment
.equ	SEG017		= 1		; 0x02 - LCD memory bit segment
.equ	SEG018		= 2		; 0x04 - LCD memory bit segment
.equ	SEG019		= 3		; 0x08 - LCD memory bit segment
.equ	SEG020		= 4		; 0x10 - LCD memory bit segment
.equ	SEG021		= 5		; 0x20 - LCD memory bit segment
.equ	SEG022		= 6		; 0x40 - LCD memory bit segment
.equ	SEG023		= 7		; 0x80 - LCD memory bit segment

; ----------	Register LCDDR1 bits		------------------------
.equ	SEG008		= 0		; 0x01 - LCD memory bit segment
.equ	SEG009		= 1		; 0x02 - LCD memory bit segment
.equ	SEG010		= 2		; 0x04 - LCD memory bit segment
.equ	SEG011		= 3		; 0x08 - LCD memory bit segment
.equ	SEG012		= 4		; 0x10 - LCD memory bit segment
.equ	SEG013		= 5		; 0x20 - LCD memory bit segment
.equ	SEG014		= 6		; 0x40 - LCD memory bit segment
.equ	SEG015		= 7		; 0x80 - LCD memory bit segment

; ----------	Register LCDDR0 bits		------------------------
.equ	SEG000		= 0		; 0x01 - LCD memory bit segment
.equ	SEG001		= 1		; 0x02 - LCD memory bit segment
.equ	SEG002		= 2		; 0x04 - LCD memory bit segment
.equ	SEG003		= 3		; 0x08 - LCD memory bit segment
.equ	SEG004		= 4		; 0x10 - LCD memory bit segment
.equ	SEG005		= 5		; 0x20 - LCD memory bit segment
.equ	SEG006		= 6		; 0x40 - LCD memory bit segment
.equ	SEG007		= 7		; 0x80 - LCD memory bit segment

; ----------	Register LCDCCR bits		------------------------
.equ	LCDDC_MASK	= 0xE0		;      -  (3 bits)
.equ	LCDDC0		= 5		;          LCDDC BIT0 position
.equ	LCDMDT		= 4		; 0x10 - LCD Maximum Drive Time
.equ	LCDCC_MASK	= 0x0F		;      - LCD Contrast Controls (4 bits)
.equ	LCDCC0		= 0		;          LCDCC BIT0 position
; ::::  LCDDC	:::: bitfield values
;			0x00		; 300us
;			0x20		; 70us
;			0x40		; 150us
;			0x60		; 450us
;			0x80		; 575us
;			0xA0		; 850us
;			0xC0		; 1150us
;			0xE0		; 50% of LCD clock
; ::::  LCDCC	:::: bitfield values
;			0x00		; 2.60V
;			0x01		; 2.65V
;			0x02		; 2.70V
;			0x03		; 2.75V
;			0x04		; 2.80V
;			0x05		; 2.85V
;			0x06		; 2.90V
;			0x07		; 2.95V
;			0x08		; 3.00V
;			0x09		; 3.05V
;			0x0A		; 3.10V
;			0x0B		; 3.15V
;			0x0C		; 3.20V
;			0x0D		; 3.25V
;			0x0E		; 3.30V
;			0x0F		; 3.35V

; ----------	Register LCDFRR bits		------------------------
.equ	LCDPS_MASK	= 0x70		;      - LCD Prescaler Selects (3 bits)
.equ	LCDPS0		= 4		;          LCDPS BIT0 position
.equ	LCDCD_MASK	= 0x07		;      - LCD Clock Dividers (3 bits)
.equ	LCDCD0		= 0		;          LCDCD BIT0 position
; ::::  LCDPS	:::: bitfield values
;			0x00		; ClkLCD/16
;			0x10		; ClkLCD/64
;			0x20		; ClkLCD/128
;			0x30		; ClkLCD/256
;			0x40		; ClkLCD/512
;			0x50		; ClkLCD/1024
;			0x60		; ClkLCD/2048
;			0x70		; ClkLCD/4096
; ::::  LCDCD	:::: bitfield values
;			0x00		; 1
;			0x01		; 2
;			0x02		; 3
;			0x03		; 4
;			0x04		; 5
;			0x05		; 6
;			0x06		; 7
;			0x07		; 8

; ----------	Register LCDCRB bits		------------------------
.equ	LCDCS		= 7		; 0x80 - LCD CLock Select
.equ	LCD2B		= 6		; 0x40 - LCD 1/2 Bias Select
.equ	LCDMUX_MASK	= 0x30		;      - LCD Mux Selects (2 bits)
.equ	LCDMUX0		= 4		;          LCDMUX BIT0 position
.equ	LCDPM_MASK	= 0x0F		;      - LCD Port Masks (4 bits)
.equ	LCDPM0		= 0		;          LCDPM BIT0 position
; ::::  LCDPM	:::: bitfield values
;			0x00		; SEG0:12
;			0x01		; SEG0:14
;			0x02		; SEG0:15
;			0x03		; SEG0:18
;			0x04		; SEG0:20
;			0x05		; SEG0:22
;			0x06		; SEG0:23
;			0x07		; SEG0:24
;			0x08		; SEG0:26
;			0x09		; SEG0:28
;			0x0A		; SEG0:30
;			0x0B		; SEG0:32
;			0x0C		; SEG0:34
;			0x0D		; SEG0:36
;			0x0E		; SEG0:38
;			0x0F		; SEG0:39

; ----------	Register LCDCRA bits		------------------------
.equ	LCDEN		= 7		; 0x80 - LCD Enable
.equ	LCDAB		= 6		; 0x40 - LCD A or B waveform
.equ	LCDIF		= 4		; 0x10 - LCD Interrupt Flag
.equ	LCDIE		= 3		; 0x08 - LCD Interrupt Enable
.equ	LCDBD		= 2		; 0x04 - LCD Buffer Disable
.equ	LCDCCD		= 1		; 0x02 - LCD Contrast Control Disable
.equ	LCDBL		= 0		; 0x01 - LCD Blanking



; ====	EXINT MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register EICRA bits		------------------------
.equ	ISC01		= 1		; 0x02 - External Interrupt Sense Control 0 Bit 1
.equ	ISC00		= 0		; 0x01 - External Interrupt Sense Control 0 Bit 0
; ::::  ISC00	>>>> This is a part of INTERRUPT_SENSE_CONTROL enum (see complete values list below)

; ----------	Register EIMSK bits		------------------------
.equ	PCIE_MASK	= 0xF0		;      - Pin Change Interrupt Enables (4 bits)
.equ	PCIE0		= 4		;          PCIE BIT0 position
.equ	INT0		= 0		; 0x01 - External Interrupt Request 0 Enable

; ----------	Register EIFR bits		------------------------
.equ	PCIF_MASK	= 0xF0		;      - Pin Change Interrupt Flags (4 bits)
.equ	PCIF0		= 4		;          PCIF BIT0 position
.equ	INTF0		= 0		; 0x01 - External Interrupt Flag 0

; ----------	Register PCMSK1 bits		------------------------
.equ	PCINT8		= 0		; 0x01 - Pin Change Mask Register pin 8
.equ	PCINT9		= 1		; 0x02 - Pin Change Mask Register pin 9
.equ	PCINT10		= 2		; 0x04 - Pin Change Mask Register pin 10
.equ	PCINT11		= 3		; 0x08 - Pin Change Mask Register pin 11
.equ	PCINT12		= 4		; 0x10 - Pin Change Mask Register pin 12
.equ	PCINT13		= 5		; 0x20 - Pin Change Mask Register pin 13
.equ	PCINT14		= 6		; 0x40 - Pin Change Mask Register pin 14
.equ	PCINT15		= 7		; 0x80 - Pin Change Mask Register pin 15

; ----------	Register PCMSK0 bits		------------------------
.equ	PCINT0		= 0		; 0x01 - Pin Change Mask Register pin 0
.equ	PCINT1		= 1		; 0x02 - Pin Change Mask Register pin 1
.equ	PCINT2		= 2		; 0x04 - Pin Change Mask Register pin 2
.equ	PCINT3		= 3		; 0x08 - Pin Change Mask Register pin 3
.equ	PCINT4		= 4		; 0x10 - Pin Change Mask Register pin 4
.equ	PCINT5		= 5		; 0x20 - Pin Change Mask Register pin 5
.equ	PCINT6		= 6		; 0x40 - Pin Change Mask Register pin 6
.equ	PCINT7		= 7		; 0x80 - Pin Change Mask Register pin 7



; ====	CPU MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register SREG bits		------------------------
.equ	SREG_I		= 7		; 0x80 - Global Interrupt Enable
.equ	SREG_T		= 6		; 0x40 - Bit Copy Storage
.equ	SREG_H		= 5		; 0x20 - Half Carry Flag
.equ	SREG_S		= 4		; 0x10 - Sign Bit
.equ	SREG_V		= 3		; 0x08 - Two's Complement Overflow Flag
.equ	SREG_N		= 2		; 0x04 - Negative Flag
.equ	SREG_Z		= 1		; 0x02 - Zero Flag
.equ	SREG_C		= 0		; 0x01 - Carry Flag

; ----------	Register MCUCR bits		------------------------
;.equ	JTD		= 7		; 0x80 - JTAG Interface Disable
.equ	BODS		= 6		; 0x40 - BOD Sleep
.equ	BODSE		= 5		; 0x20 - BOD Sleep Enable
.equ	PUD		= 4		; 0x10 - Pull-up disable
.equ	IVSEL		= 1		; 0x02 - Interrupt Vector Select
.equ	IVCE		= 0		; 0x01 - Interrupt Vector Change Enable

